.emacs.d/init.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle "init.el"

* Introduction
This is my emacs configuration at the limit of N\to\infty, where N is the number of iterations that the config has suffered. Since the condition for the thermodynamic limit has been satisfied, this config behaves the way I want. At least for most of the things I want. For the people not familiar with the thermodynamic limit, I will try to explain in a couple of sentences. Imagine a bottle filled with air. When the number of air molecules in the bottle is large enough, what an individual molecule do doesn't matter, but emergent quantities like density and pressure determine the dynamics. An analogy drawn to the config would be how the config collectively behaves versus each code block blocking the other functions.
The blogs and tutorials that have been helpful are the following.  

1. [[https://systemcrafters.net/emacs-from-scratch/] Systems Crafters Emacs from scratch]
2. [[https://hieuphay.com/doom-emacs-config/] My emacs config by Hieu Phay] and possibly also vanilla emacs config [[https://hieuphay.com/emacs-config/]]
3. [https://michaelneuper.com/posts/efficient-latex-editing-with-emacs] Introduction to latex editing by Micheal Neuper]
4. https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org Notes on the config. Could be important.
 
The following are blogs are also recommended, as it pop-ups frequently when searching for other people configs.  Although I have never read these blogs to put firm weight on the recommendation.

1. [[https://sachachua.com/dotemacs/index.html#babel-init] Sacha Chua emacs config]
2. Mastering Emacs [[https://www.masteringemacs.org/book]] 
 
** Emacs as a whole
The title makes a very little sense, I will rant about my thoughts on emacs for a while. A little background is necessary. Computer was never a part of my work life until I started my Master's degree. Even then the use case was limited to writing basic fortran programs in a shared machine. The real machine I had was when I quit the Master's degree and joined an Integrated MS-PhD program. It was quite late for a machine at this age (around 2014). Also, the etiquette to maintain a good habit of taking notes, organizing them into publishable articles, writing good codes e.t.c was missing. I am blaming it to not having a computer, but having a good environment enabling people to do these things also matter. 

Having a personal machine changed a few things. Social media provied the environment, as I was able to read on how people organize life. As time went by I was needed to write both programs and codes a lot. And then came the configuration blackhole of Emacs. Historically speaking the software itself was written in 70s. Its age is comparable to lifetime of a person for instance. It is amazing to think on how a software this old has survived to date and is actively maintained. There are many libraries which are also old, but software packages are few. 

Since emacs is very old, it is like old-grandpa/mom (can't think of any gender-neutral term here). Like grandpa has done a lot in his life, a lot of things have been done in emacs. Thus, there are thousands/millions of functions that are build in it. It gets difficult to browse through them to know what each of these do. (Can't organize my thoughts at this moment will revisit later) One key aspect of elisp is that although it is fun, of which some needs to be called in certain sequence to acheive what you desire with the Emacs.  There are simply too many of them and at this point of time no one would be able to provide an appropriate answer. Another aspect that I think has emerged is that there are many function api's which perform similarly differing only very slightly. Come up with some example here.

** Not working or needs improvements
The following are the configs I would want to implement at some level to enhance my work flow
1. Organize the config into sub parts to ensure that each source blocks has only about 60?70 lines of config. It should be such that each block fits into the screen perfectly.
2. Table in org-mode with +----+---+ is bit weird
3. Corfu not working with yas. Fix it.
4. pdf-tools scroll is not very smooth
5. Configure Magit and fly-check
6. EMMS set up a local music directory with few music
   
   
* Important definitions

| SYMBOLS | DEFINITION             | DESCRIPTION                                      |
| M-x     | Yas-describe-table     | loads all the snippets for the current mode      |
| M-x     | customize-variable     | will allow customization of any variables.       |
| M-x     | describe-function      | will describe the desired function               |
| C-c n l | org-roam-buffer-toggle | toggle between different org-roam buffers        |
| C-c n f | org-roam-node-find     | Find a node in org roam file with specific title |
| C-c n i | org-roam-node-insert   | Insert a title with a org-roam node              |
| C-M-i   | completion-at-point    | Complete at a point in a emacs traditional way   |
| M-i     | tab-to-tab-stop        | Inserts tab                                      |
| C-\     | toggle-input-method    | Useful to insert greek symbols in julia block    |
|         |                        |                                                  |

In zathura synctex use control and mouse button 1 to go to the text buffer opened in emacs.


* General
The general setting for the username, font and have the scratch buffer as the start etc.  
** Server
This command should come at the very beginning. The purpose is to start a server with which several files can be opened in an existing emacs software. Just type emacsclient <filename> anywhere in the terminal, it will open in an existing emacs window, provided it is running in the background. 

#+begin_src emacs-lisp :tangle "init.el"
(server-start)
#+end_src

** Username and font
The font I the have converged on are following
*Fixed-space* where the each letter are spaced equally aka monospaced
1. Fira-Mono/Code (Code variants comes with ligatures which eventually becomes difficult to edit.)
2. Source-Code Pro
3. Mononoki 
4. IBM-PLEX-MONO
5. Iosevka
*Variable Pitch* letters are not fixed pitched
1. Fira-Sans-Book 
2. IBM-Sans ; Source-Code-Sans;  Source-SansV15
3. Cartilla
4. TeX Gyre Pagella/Iosevka Etiole  for a book like feel
5. Iosevka Nerd Font (Maybe this has fixed pitch) Iosevka Etoile
6. Cardo google font. The famous book Mastering Emacs  uses this font. 
Important hack to remember here is that all of the above font can be build in Iosevka. This has already been done and are present in the arch package manager as ttc-iosevka-ss<xx> xx is number corresponding to some build close to above mentioned font.
#+begin_src emacs-lisp :tangle "init.el" 

;username
  (setq user-full-name "Vikash"
        user-mail-address "vkpnbeta@gmail.com")

(add-to-list 'exec-path "/home/vikash/opt/anaconda3/bin")
(add-to-list 'exec-path "/home/vikash/opt/julia-1.10.0/bin")
; julia path
(setenv "PATH" (concat (getenv "PATH") ":" (expand-file-name "/home/vikash/opt/julia-1.10.0/bin")))
(setenv "PATH" (concat (expand-file-name "/home/vikash/opt/anaconda3/bin") ":" (getenv "PATH")))

;set the font
(set-face-attribute 'default nil :font "Iosevka Custom" :height 150 :weight 'Semibold)
(set-face-attribute 'fixed-pitch nil :font "Iosevka Custom" :height 150 :weight 'Semibold)
;; (set-face-attribute 'variable-pitch nil :font "SourceSans3VF" :height 155 :weight 'Regular)
(set-face-attribute 'variable-pitch nil :font "CMU Typewriter Text" :height 170 :weight 'Regular)
;;(set-face-attribute 'variable-pitch nil :font "Iosevka Etoile" :height 145 :weight 'Regular)
;; (set-face-attribute 'variable-pitch nil :font "CMU Concrete" :height 135 :weight 'SemiBold)

#+end_src

#+RESULTS:
** The looks of buffer
The codes below customizes the buffer. I think the commands are self-explainatory.

#+begin_src emacs-lisp

(setq make-backup-files nil
      auto-save-default nil) ; to prevent emacs from creating files with ~ in the end. 
(setq inhibit-startup-message t) ; Disable startup message
(switch-to-buffer "*scratch*")   ; Switch to *scratch* buffer on startup
(setq initial-scratch-message "
; #+PROPERTY: header-args:jupyter-julia  :session ~/.kernel/emacs-julia-1.10-kernel.json
; #+PROPERTY: header-args:jupyter-julia  :session /ssh:vikash<hostname>:~/.kernel/emacs-julia-1.10-kernel.json
"); Although these are set in yasnippet I want it in here so that it can be pasted quickly in the org-mode
(setq use-dialog-box nil) 
(defalias 'yes-or-no-p 'y-or-n-p) ; no need to type yes and no in emacs
(display-time) ; display time in the modebar
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(show-paren-mode 1)
(electric-pair-mode t) ; always make two brackets or quotes 
(save-place-mode t)
(savehist-mode t)
(recentf-mode t)
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
;; (setq indent-line-function 'insert-tab)
(setq ring-bell-function 'ignore)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
;; These are for the transparancy
(set-frame-parameter nil 'alpha-background 100) ; For current frame
(add-to-list 'default-frame-alist '(alpha-background . 100))

#+end_src


* Straight
Straight is a package manager which downloads package from the git. I also load the org immediately because the org version error that appears constantly whenever I call any org functions.

#+begin_src emacs-lisp :tangle "init.el" 
        
(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

#+end_src

** Install org-mode
Seems this is a dependency from emacs-jupyter package which installs org from the package manager. I would have liked to have jupyter rely on the org that comes default with the emacs installation. Since this is not the case I will have to install it. 
#+begin_src emacs-lisp :tangle "init.el"

(use-package org
  :straight t
  :ensure t)

#+end_src
            

