.emacs.d/init.el
(server-start)

;username
  (setq user-full-name "Vikash"
        user-mail-address "vkpnbeta@gmail.com")

(add-to-list 'exec-path "/home/vikash/opt/anaconda3/bin")
(add-to-list 'exec-path "/home/vikash/opt/julia-1.10.0/bin")
; julia path
(setenv "PATH" (concat (getenv "PATH") ":" (expand-file-name "/home/vikash/opt/julia-1.10.0/bin")))
(setenv "PATH" (concat (expand-file-name "/home/vikash/opt/anaconda3/bin") ":" (getenv "PATH")))

;set the font
(set-face-attribute 'default nil :font "Iosevka Custom" :height 150 :weight 'Semibold)
(set-face-attribute 'fixed-pitch nil :font "Iosevka Custom" :height 150 :weight 'Semibold)
;; (set-face-attribute 'variable-pitch nil :font "SourceSans3VF" :height 155 :weight 'Regular)
(set-face-attribute 'variable-pitch nil :font "CMU Typewriter Text" :height 170 :weight 'Regular)
;;(set-face-attribute 'variable-pitch nil :font "Iosevka Etoile" :height 145 :weight 'Regular)
;; (set-face-attribute 'variable-pitch nil :font "CMU Concrete" :height 135 :weight 'SemiBold)

(setq make-backup-files nil
      auto-save-default nil) ; to prevent emacs from creating files with ~ in the end. 
(setq inhibit-startup-message t) ; Disable startup message
(switch-to-buffer "*scratch*")   ; Switch to *scratch* buffer on startup
(setq initial-scratch-message "
; #+PROPERTY: header-args:jupyter-julia  :session ~/.kernel/emacs-julia-1.10-kernel.json
; #+PROPERTY: header-args:jupyter-julia  :session /ssh:vikash<hostname>:~/.kernel/emacs-julia-1.10-kernel.json
"); Although these are set in yasnippet I want it in here so that it can be pasted quickly in the org-mode
(setq use-dialog-box nil) 
(defalias 'yes-or-no-p 'y-or-n-p) ; no need to type yes and no in emacs
(display-time) ; display time in the modebar
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(show-paren-mode 1)
(electric-pair-mode t) ; always make two brackets or quotes 
(save-place-mode t)
(savehist-mode t)
(recentf-mode t)
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
;; (setq indent-line-function 'insert-tab)
(setq ring-bell-function 'ignore)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
;; These are for the transparancy
(set-frame-parameter nil 'alpha-background 100) ; For current frame
(add-to-list 'default-frame-alist '(alpha-background . 100))

(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(use-package org
  :straight t
  :ensure t)
