.emacs.d/init.org
* Numbers and dired
Numbers are by default not highlited in emacs. In program mode I like to have the numbers colored differently for more visibility. This is done using highlight-numbers package. Similarly unicode-fonts and nerd-fonts are used to present folders and other things as an icon in dired (directory-mode or buffers). These are simply for the asthetic part of the emacs and serves no purpose in production part. Although it is nice to have a well designed interface if I am spending a lot of time in a day just staring at it. At the end of source block are custom faces which sets the color of the numbers. In addition other org-mode configs are also here. The emacs does it automatically, hence I have kept it all here as I call highlight number the first time.

#+begin_src emacs-lisp :tangle "init.el"

(use-package highlight-numbers
  :straight t
  :ensure t)

(add-hook 'prog-mode-hook #'highlight-numbers-mode)

(use-package unicode-fonts
  :straight t
  :config 
  (unicode-fonts-setup))

(use-package nerd-icons
  :straight t
  ;; :custom
  ;; "Symbols Nerd Font Mono" is the default and is recommended but you can use any other Nerd Font if you want
  ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
  )

(use-package dired-sidebar
  ;; This gives the option to have a nice sidebar with all the dired options.
  :ensure t
  :straight t
  :commands (dired-sidebar-toggle-sidebar))

 (setq dired-sidebar-subtree-line-prefix "__")
 (setq dired-sidebar-use-term-integration t)

(use-package nerd-icons-dired
  :straight t
  :hook
  (dired-mode . nerd-icons-dired-mode))

(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(highlight-numbers-number ((t (:aquamarineforeground "BlueViolet"))))  
 '(org-block ((t (:background "#F8F8FF" :extend t)))) ;; These are for light theme
 '(org-block-begin-line ((t (:foreground "gray1" :background "#EDEADE" :extend t)))) ; light theme
 '(org-block-end-line ((t (:foreground "gray1" :background "#EDEADE" :extend t)))) ; light theme
;  '(org-block ((t (:background "gray10" :extend t)))) ;For dark theme
 ;; '(org-block-begin-line ((t (:foreground "gray60" :background "#595959" :extend t)))) ;For dark  theme
 ;; '(org-block-end-line ((t (:foreground "gray60" :background "#595959" :extend t)))) ; for dark theme
 '(org-level-1 ((t (:foreground "DarkRed" :extend t)))) ; use VoiletRed1 in modus-vivendi
 '(org-level-2 ((t (:foreground "DarkRed" :extend t))))
 '(org-level-3 ((t (:foreground "DarkRed" :extend t))))
 '(org-level-4 ((t (:foreground "DarkRed" :extend t))))
 '(org-level-5 ((t (:foreground "DarkRed" :extend t))))
)
  
#+end_src

#+RESULTS:


* Evil
Evil is the vim-like keybindings in emacs. It is so good that I have never felt the transition process. Doom emacs implements it even better. Here I have evil everywhere as long as I am programming. I don't have evil-mode activated in org-agenda.    
** Load the evil and other subsidiary.
#+begin_src emacs-lisp :tangle "init.el"
  
  (use-package evil
      :straight t
    :ensure t
    :init
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1))
 
    (use-package evil-collection
      :straight t
      :ensure t
      :after evil
      :config
     ; (evil-want-keybinding nil)
      (evil-collection-init))

    (use-package evil-escape
      :straight t
      :ensure t
      :config
      (evil-escape-mode 1)
      (setq-default evil-escape-key-sequence "fd"))

#+end_src

** Evil packages 
These are packages even in vim. It is great that it is implemented in Emacs as well.

#+begin_src emacs-lisp :tangle "init.el"

    (use-package evil-surround
      :straight t
      :ensure t
      :config
      (global-evil-surround-mode 1))

    (use-package evil-commentary
      :straight t
      :ensure t
      :config
      (evil-commentary-mode))

  (use-package evil-org
      :straight t
      :ensure t
      :config
      (add-hook 'org-mode-hook 'evil-org-mode))

;(define-key evil-normal-state-map (kbd "gj") 'evil-next-visual-line)
;;(define-key evil-insert-state-map (kbd "<tab>") 'tab-to-tab-stop)

(define-key evil-motion-state-map [remap evil-next-line] #'evil-next-visual-line)
(define-key evil-motion-state-map [remap evil-previous-line] #'evil-previous-visual-line)

                    

#+end_src



* Theme
I will rant for a while. 
Finally settled with the vanilla emacs color scheme with some modification to the org-mode source block. Had to add a shade for org-source blocks.

#+begin_src emacs-lisp :tangle "init.el"

(use-package doom-themes
  :straight t
  )
(use-package spacemacs-theme
  :straight t
  )

(load-theme 'modus-operandi t) 
;; (load-theme 'modus-vivendi t) 
;; (load-theme 'doom-gruvbox-light t) 
;;(load-theme 'spacemacs-light t)
(use-package doom-modeline
  :ensure t
  :straight t
  :hook (after-init . doom-modeline-mode))
(setq doom-modeline-height 20)
;; this is not a theme but colors the braces for better visibility
(use-package rainbow-delimiters
  :straight t
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

#+RESULTS:
| rainbow-delimiters-mode | highlight-numbers-mode | display-line-numbers-mode |


* Completions
** Minibuffer completion
Use the ivy with fuzzy finding for the minibuffer. Setting initial-inputs 

#+begin_src emacs-lisp :tangle "init.el"
(use-package flx
      :straight t
      :ensure t)

  (use-package ivy
    :straight t
    :config
      (setq ivy-use-virtual-buffers t
          ivy-count-format "(%d/%d) "
         ;; ivy-initial-inputs-alist nil
         ))

  (use-package counsel
    :straight t
    :ensure t
    :config
    (ivy-mode 1)
    (setq ivy-height 20)
    (setq ivy-re-builders-alist
      '((ivy-switch-buffer . ivy--regex-plus)
        (t . ivy--regex-fuzzy))))



  ;; (setf (alist-get 'counsel-ag ivy-re-builders-alist)
  ;;       #'ivy--regex-fuzzy)

;(global-set-key (kbd "TAB") (lambda () (interactive) (insert-char 32 4)))

(global-set-key (kbd "C-s") 'swiper-isearch)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "M-y") 'counsel-yank-pop)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "<f2> j") 'counsel-set-variable)
(global-set-key (kbd "C-x b") 'ivy-switch-buffer)
(global-set-key (kbd "C-c v") 'ivy-push-view)
(global-set-key (kbd "C-c V") 'ivy-pop-view)
  ;This sets ivy--regex-fuzzy as the fuzzy matching strategy for all Ivy completion.
  ;Optionally, you can also enable ivy-mode globally for all buffers. Add the following line to your configuration:

  (use-package ibuffer
    :straight t
     :config
    (evil-set-initial-state 'ibuffer-mode 'normal))

(use-package nerd-icons-ibuffer
  :ensure t
  :straight t
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

  (use-package general
    :straight t
    :config
    (general-define-key
      :states '(normal visual insert emacs)
      :prefix "SPC"
      :non-normal-prefix "M-SPC"
      "b i" 'ibuffer
      "f f" 'counsel-find-file
      "m t" 'org-todo
       "n t" 'org-todo-list
  ))


(use-package yasnippet
  :straight t
  :config
  (yas-global-mode))
(define-key yas-minor-mode-map (kbd "TAB") 'yas-expand)
(define-key yas-minor-mode-map (kbd "<tab>") 'yas-expand)


(use-package yasnippet-snippets
  :straight t)

(setq yas-snippet-dirs (append yas-snippet-dirs
                               '("/home/vikash/.emacs.d/snippets")))
(use-package which-key
  :straight t
  :init
  (setq
   which-key-show-early-on-C-h t
   which-key-idle-delay 10000
   which-key-idle-secondary-delay 0.05
  which-key-popup-type 'minibuffer
  which-key-side-window-max-height 0.25)
  :config
  (which-key-mode) 
  )

;; ibuffer-sidebar seems to not work well
(use-package ibuffer-sidebar
  :straight t
  :commands (ibuffer-sidebar-toggle-sidebar)
  )

(defun +sidebar-toggle ()
  "Toggle both `dired-sidebar' and `ibuffer-sidebar'."
  (interactive)
  (dired-sidebar-toggle-sidebar)
  (ibuffer-sidebar-toggle-sidebar))

(use-package ivy-rich
  :straight t
  :init 
 (ivy-rich-mode 1))

(use-package nerd-icons-ivy-rich
  :straight t
  :ensure t
  :init
  (nerd-icons-ivy-rich-mode 1)
  )


#+end_src

#+RESULTS:
: +sidebar-toggle

