.emacs.d/init.org
** Main buffer completion
Use corfu with orderless for the main buffer completion

#+begin_src emacs-lisp :tangle "init.el"
  (use-package company
    :straight t
    :ensure t)

  ;; (add-hook 'org-mode-hook
  ;;           (lambda ()
  ;;             (setq-local company-backends
  ;;                         (cons 'company-capf company-backends))))

  (add-to-list 'company-backends 'company-dabbrev-code) 
  (add-to-list 'company-backends 'company-yasnippet)
  (add-to-list 'company-backends 'company-files)

  ;; somehow corfu doesnot work
  (use-package corfu
    :straight t
    :config
    (global-corfu-mode)
    (setq corfu-cycle t
          corfu-auto t
          corfu-commit-predicate nil
          corfu-quit-at-boundary t
          corfu-quit-no-match 'separator
          corfu-echo-documentation nil))

  (use-package orderless
    :straight t
    :config
    (setq completion-styles '(orderless)
          orderless-component-separator #'orderless-escapable-split-on-space))

  (global-set-key [remap completion-at-point] #'corfu-completion-at-point)
  (global-set-key [remap completion] #'corfu-completion)

  (with-eval-after-load 'corfu
    (setq corfu-auto-delay 0.2
          corfu-auto-prefix-style 'partial
          corfu-commit-delay 0.1
          corfu-echo-documentation nil
          corfu-quit-delay 0.2
          corfu-quick-help-delay 1.0
          corfu-quick-help-height 30))


  ;; Use Dabbrev with Corfu!
  (use-package dabbrev
    :straight t
    ;; Swap M-/ and C-M-/
    :bind (("M-/" . dabbrev-expand)
           ("C-M-/" . dabbrev-completion))
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    ;; Since 29.1, use `dabbrev-ignored-buffer-regexps' on older.
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode))

  ;; Add extensions
  (use-package cape
    :straight t
    ;; Bind dedicated completion commands
    ;; Alternative prefix keys: C-c p, M-p, M-+, ...
    :bind (("C-c p p" . completion-at-point) ;; capf
           ("C-c p t" . complete-tag)        ;; etags
           ("C-c p d" . cape-dabbrev)        ;; or dabbrev-completion
           ("C-c p h" . cape-history)
           ("C-c p f" . cape-file)
           ("C-c p k" . cape-keyword)
           ("C-c p s" . cape-elisp-symbol)
           ("C-c p e" . cape-elisp-block)
           ("C-c p a" . cape-abbrev)
           ("C-c p l" . cape-line)
           ("C-c p w" . cape-dict)
           ("C-c p \\" . cape-tex)
           ("C-c p _" . cape-tex)
           ("C-c p ^" . cape-tex))
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-elisp-block)
    ;;(add-to-list 'completion-at-point-functions #'cape-history)
    ;;(add-to-list 'completion-at-point-functions #'cape-keyword)
    ;;(add-to-list 'completion-at-point-functions #'cape-tex)
    ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
    ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
    ;;(add-to-list 'completion-at-point-functions #'cape-abbrev)
    ;;(add-to-list 'completion-at-point-functions #'cape-dict)
    ;;(add-to-list 'completion-at-point-functions #'cape-elisp-symbol)
    ;;(add-to-list 'completion-at-point-functions #'cape-line)
  )


(use-package yasnippet-capf
  :straight t
  :after cape
  :config
  (add-to-list 'completion-at-point-functions #'yasnippet-capf))
;; It expands automoatically which is annoying
(setopt corfu-on-exact-match 'show)
;; (require 'company-yasnippet)
;; (add-to-list 'completion-at-point-functions
;;                      (cape-company-to-capf #'company-yasnippet))


  (use-package emacs
    :straight t
    :init
    ;; TAB cycle if there are only few candidates
    (setq completion-cycle-threshold 3)
    ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
    ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
    ;; (setq read-extended-command-predicate
    ;;       #'command-completion-default-include-p)
    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (setq tab-always-indent 'complete))

  (use-package nerd-icons-corfu
    :straight t
    )
(add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)

  ;; (add-hook 'org-mode-hook 'corfu-mode)

#+end_src

#+RESULTS:


* Org-mode configuration
** General
#+begin_src emacs-lisp :tangle "init.el"


  ;; src block indentation / editing / syntax highlighting
  (setq org-src-fontify-natively t
        org-src-window-setup 'current-window ;; edit in current window
        org-src-strip-leading-and-trailing-blank-lines t
 ;       org-src-tab-acts-natively t
        org-latex-create-formula-image-program 'dvisvgm
        org-src-preserve-indentation t) ;; do not put two spaces on the left

(defun my/org-src-tab-width ()
  "Set tab width to 4 spaces in Org source blocks."
  (setq-local tab-width 4)
  (setq-local indent-tabs-mode nil))

;; Disable line number mode in several buffers;
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))


;(add-hook 'org-mode-hook
;          (lambda ()
;            (add-hook 'org-src-mode-hook 'my/org-src-tab-width)))

(defun my/org-src-tab-insert ()
  "Insert 4 spaces instead of a tab in Org source blocks."
  (interactive)
  (if (org-in-src-block-p)
      (insert "   ")
    (call-interactively 'indent-for-tab-command)))

; (define-key org-src-mode-map (kbd "TAB") 'my/org-src-tab-insert)

(setq org-ellipsis " ····")
#+end_src

#+RESULTS:
: my/org-src-tab-insert

** Font and feel for the org-mode buffers
First we set visual look and later we set the bullets.
*** Fill the column for nicer look
Here we set the visual fill column mode for the nice feel it provides. 

#+begin_src emacs-lisp :tangle init.el
(use-package visual-fill-column
  :ensure t
  :commands visual-fill-column-mode)

(setq visual-fill-column-width 140
      visual-fill-column-center-text t)

(defun org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(add-hook 'org-mode-hook 'visual-fill-column-mode)
(add-hook 'ibuffer-mode-hook 'visual-fill-column-mode)
(add-hook 'org-mode-hook 'org-mode-setup)

#+end_src

