.emacs.d/init.org
*** Font config

#+begin_src emacs-lisp :tangle init.el

    ;; (custom-set-faces
    ;; '(variable-pitch ((t (:family "CMU Sans Serif" :height 150)))))
(add-hook 'org-mode-hook 'variable-pitch-mode) 

  (defun org-font-setup ()
    ;; Replace list hyphen with dot
   (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.40)
                    (org-level-2 . 1.30)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.05)
                    (org-level-6 . 1.05)
                    (org-level-7 . 1.05)
                    (org-level-8 . 1.05)))
      (set-face-attribute (car face) nil :font "CMU Typewriter Text" :weight 'Bold :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-document-info-keyword nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-property-value nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-tag nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block-begin-line nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block-end-line nil :inherit 'fixed-pitch)
    )
(org-font-setup)

#+end_src

#+RESULTS:

*** Org mode bullets
Here we set the bullets to make the headings clear

#+begin_src emacs-lisp :tangle init.el

(use-package org-bullets
  :straight t
  :ensure t
  :after org
  :hook (org-mode . org-bullets-mode)
  :config
  (setq org-bullets-bullet-list '("➜" "⤷" "⤷" "⤷" "⤷")))

;➀➁➂➃➄➅➆➇➈➉
;➜	
;✰✱✲✳✴✵✶✷✸✹✺	
;➥	
;⟾	
;⤿
;⟹🢂	
#+end_src

*** Set up the template
Set the template for setting the

#+begin_src emacs-lisp :tangle init.el
(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("jp" . "src jupyter-python"))
  (add-to-list 'org-structure-template-alist '("jj" . "src jupyter-julia"))
)

#+end_src

** Babel configuration

#+begin_src emacs-lisp :tangle "init.el"

(use-package gnuplot
  :straight t
  )

;; (use-package ob-async
;;   :straight t)

;; (use-package ob-ipython
;;   :straight t
;;   )

(use-package jupyter
  :straight t
  )


(use-package ess
:straight t
)

(use-package julia-mode
:straight t
)

(use-package julia-vterm
:straight t
)

  ; to prevent the funny indentation.

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (jupyter . t)
       (shell . t)
       (latex . t)
       (dot . t)
       (gnuplot . t)
       (julia . t)
       )
     )

 (with-eval-after-load 'jupyter 
    (define-key jupyter-repl-mode-map (kbd "C-l") #'jupyter-repl-clear-cells)
    (define-key jupyter-repl-mode-map (kbd "TAB") #'company-complete-common-or-cycle)
   ; (define-key jupyter-org-interaction-mode-map (kbd "TAB") #'company-complete-common-or-cycle)
    (define-key jupyter-repl-interaction-mode-map (kbd "C-c C-r") #'jupyter-eval-line-or-region)
    (define-key jupyter-repl-interaction-mode-map (kbd "C-c M-r") #'jupyter-repl-restart-kernel)
    (define-key jupyter-repl-interaction-mode-map (kbd "C-c M-k") #'jupyter-shutdown-kernel)
   ; (add-hook 'jupyter-org-interaction-mode-hook (lambda ()  (company-mode)
   ;						   (setq company-backends '((company-capf))))) 
  ;  (add-hook 'jupyter-repl-mode-hook (lambda () (company-mode)
				;        :config (set-face-attribute
					;         'jupyter-repl-input-prompt nil :foreground "dim gray")
				       ; :config (set-face-attribute
					;         'jupyter-repl-input-prompt nil :background "lightblue")
				        ;; :config (set-face-attribute 'comment
				        ;; 			    nil :foreground "dim gray")
				        ;:config (set-face-attribute
					;         'jupyter-repl-output-prompt nil :foreground "black")
;				        (setq company-backends '((company-capf)))))
    ;; (add-hook 'jupyter-repl-mode-hook #'smartparens-mode)
    ;; (setq jupyter-repl-prompt-margin-width 4)
    )


(add-to-list 'org-src-lang-modes '("jupyter-julia" . julia))
(add-to-list 'org-src-lang-modes '("jupyter-python" . python))

(defalias 'org-babel-variable-assignments:jupyter-julia 'org-babel-variable-assignments:julia)
(add-hook 'julia-mode-hook #'julia-vterm-mode)
;; (setq org-ditaa-jar-path "/usr/share/java/ditaa/ditaa-0.11.jar")
(push '("conf-unix" . conf-unix) org-src-lang-modes)
(setq org-confirm-babel-evaluate nil)
;; Syntax highlight in #+BEGIN_SRC blocks
(setq org-src-fontify-natively t)

(add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
;(add-hook org-babel-after-execute-hook 'org-display-inline-images 'append)

#+end_src

#+RESULTS:
| org-redisplay-inline-images |

** Org-agenda for organizing my calender
Org-agenda is an old way to track journals set up meetings etc. With different calanders that do it automatically this program will not that useful now I guess. I want it do just track basic todos and any travel plans I have. 

*** Keybindings
Coming from the vim mode I keep pressing j and k in the org-agenda mode. These are bound to go-to-date-time and capture template respectively. Since I don't need to use these, best I unbind them and leave these function unassigned. I want my agenda to load very fast. hence F7 

#+begin_src emacs-lisp :tangle init.el

(global-set-key (kbd "<f7>") 'org-agenda)

(eval-after-load 'org-agenda
  '(progn
     (define-key org-agenda-mode-map "j" nil)
     (define-key org-agenda-mode-map "k" nil)))                                       ;

#+end_src

*** Basic settings
Here I set the basics of agenda and set files from which to read the entries for dashboard. It expects Tasks and Meetings and Planning  
#+begin_src emacs-lisp :tangle init.el

 (setq     org-agenda-start-with-log-mode t
      org-log-done 'time
      org-log-into-drawer t
      org-agenda-span 8
      org-agenda-start-on-weekday nil
      org-agenda-start-day "-3d"
      org-agenda-files
      '("~/Documents/OrgFiles/Tasksandmeetings.org"  ;; Tasksandmeeting.org
        "~/Documents/OrgFiles/Planning.org" ;; Planning.org
        "~/Documents/OrgFiles/Birthdays.org") ;; Birthdays.org
      org-todo-keywords
      '((sequence "TODO(t)" "STARTED" "|" "DONE(d)" "CANC(c)")
       (sequence "PLAN(p)" "REMINDER(r)" "WAIT(w@/!)" "|" "COMPLETED(c)" "CANCELLED(k@)" ))
      )


(setq org-refile-targets
      '(("~/Documents/Orgfiles/Archive.org" :maxlevel . 1)))

;; Save Org buffers after refiling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)

#+end_src

#+RESULTS:

*** Dashboard 
 This is the main deal. Here I will design what I want to appear in the dashboard.

#+begin_src emacs-lisp :tangle init.el

(setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
          (todo "PLAN"
                ((org-agenda-overriding-header "planning")))
           (todo "TODO"
                ((org-agenda-overriding-header "todos")))
          (todo "REMINDER"
                ((org-agenda-overriding-header "Reminders")))))))



#+end_src


