.emacs.d/init.org
*** Capture the template
#+begin_src emacs-lisp :tangle init.el

(setq org-capture-templates
      `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp "~/Documents/OrgFiles/Tasksandmeetings.org" "Meetings")
         "** TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
        ("p" "plan / Reminder")
        ("pp" "Plan" entry (file+olp "~/Documents/OrgFiles/Planning.org" "Future Plans")
         "** PLAN %?\n  %U\n  %a\n  %i" :empty-lines 1)
        ("j" "Journal Entries")
        ("jj" "Journal" entry
         (file+olp+datetree "~/Documents/OrgFiles/Journal.org")
         "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
         :clock-in :clock-resume
         :empty-lines 1)
        ))

(define-key global-map (kbd "C-c j")
  (lambda () (interactive) (org-capture nil "jj")))

(define-key global-map (kbd "C-c p")
  (lambda () (interactive) (org-capture nil "pp")))

(define-key global-map (kbd "C-c t")
  (lambda () (interactive) (org-capture nil "tt")))

#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (org-capture nil tt) |

** Org-Roam
Org roam is a new note-keeping tools in emacs and integrates well with org. I don't use org-mode a lot; but since I am unable to escape the note keeping part and a lot of documents I read tends to get lost over time leading to an infinite loop of doing the same thing again and again. I will start organizing my notes using org-roam from now on. The below configuration is copy pasted from
 davil emacs-from scratch series.
 
#+begin_src  emacs-lisp

(use-package org-roam
  :ensure t
  :straight t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Documents/my_notes/RoamNotes")
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i"    . completion-at-point))
  :config
  (org-roam-setup))

  (use-package citar-org-roam
  :straight t
  :after (citar org-roam)
  :config (citar-org-roam-mode))
#+end_src

#+RESULTS:
: completion-at-point


* Eglot and treesitter

** Eglot

#+begin_src emacs-lisp :tangle init.el

 (use-package project :straight t) ;; Somehow the project is removed 

  (use-package eglot
    :straight t
;    :hook
     ;; (c-mode-hook . eglot-ensure)
     ;; (f90-mode-hook . eglot-ensure)
    )

(with-eval-after-load 'eglot
   (setq completion-category-defaults nil))

(advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)

#+end_src

#+RESULTS:

** tree-sitter

Tree sitter is a new way of highlighting

#+begin_src emacs-lisp :tangle init.el

    (use-package tree-sitter
      :straight t
      :init
       (global-tree-sitter-mode))

    (use-package tree-sitter-langs
      :straight t
    )
  ;; (add-hook 'python-mode-hook #'tree-sitter-mode)

(setq treesit-language-source-alist
      '(
     (bash "https://github.com/tree-sitter/tree-sitter-bash")
     (cmake "https://github.com/uyha/tree-sitter-cmake")
     (elisp "https://github.com/Wilfred/tree-sitter-elisp")
     (json "https://github.com/tree-sitter/tree-sitter-json")
     (make "https://github.com/alemuller/tree-sitter-make")
     (markdown "https://github.com/ikatyang/tree-sitter-markdown")
     (python "https://github.com/tree-sitter/tree-sitter-python")
     (yaml "https://github.com/ikatyang/tree-sitter-yaml")
     (fortran  "https://github.com/stadelmanma/tree-sitter-fortran")
     (c "https://github.com/tree-sitter/tree-sitter-c")
     (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
     (cuda "https://github.com/theHamsta/tree-sitter-cuda")
     (julia "https://github.com/tree-sitter/tree-sitter-julia")
     (latex "https://github.com/latex-lsp/tree-sitter-latex")
     (org"https://github.com/milisims/tree-sitter-org")
   ))

#+end_src

#+RESULTS:
| bash     | https://github.com/tree-sitter/tree-sitter-bash    |
| cmake    | https://github.com/uyha/tree-sitter-cmake          |
| elisp    | https://github.com/Wilfred/tree-sitter-elisp       |
| json     | https://github.com/tree-sitter/tree-sitter-json    |
| make     | https://github.com/alemuller/tree-sitter-make      |
| markdown | https://github.com/ikatyang/tree-sitter-markdown   |
| python   | https://github.com/tree-sitter/tree-sitter-python  |
| yaml     | https://github.com/ikatyang/tree-sitter-yaml       |
| fortran  | https://github.com/stadelmanma/tree-sitter-fortran |
| c        | https://github.com/tree-sitter/tree-sitter-c       |
| cpp      | https://github.com/tree-sitter/tree-sitter-cpp     |
| cuda     | https://github.com/theHamsta/tree-sitter-cuda      |
| julia    | https://github.com/tree-sitter/tree-sitter-julia   |
| latex    | https://github.com/latex-lsp/tree-sitter-latex     |
| org      | https://github.com/milisims/tree-sitter-org        |


* Latex
** Font 
The font in the latex is set to Typewriter text from CMU. 
#+begin_src emacs-lisp :tangle init.el
 (defun my/set-latex-font ()
  "Set a different font for LaTeX files."
  (face-remap-add-relative 'default :family "CMU Typewriter Text" :height 170))

(add-hook 'LaTeX-mode-hook 'my/set-latex-font)
 
#+end_src

#+RESULTS:
| my/set-latex-font | preview-mode-setup | citar-capf-setup | my/latex-hooks | TeX-source-correlate-mode |

** General latex configuration

#+begin_src emacs-lisp :tangle init.el

;; latex config 
;; this is for reading pdf in emacs;
(use-package pdf-tools
  :straight t)
(pdf-tools-install)

(defun my/hooks_pdf_tools ()
  "Disable line numbers in the current buffer."
  (display-line-numbers-mode -1)
  (auto-revert-mode 1)
)

(add-hook 'pdf-view-mode-hook 'my/hooks_pdf_tools)

(use-package auctex
  :straight t
  )

(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master 'nil)

(use-package xenops
  :straight t )
;;   ;:config
;; (add-hook LaTeX-mode-hook xenops-mode)
;; (add-hook LaTeX-mode-hook #'xenops-mode))

;; Add this to .emacs.d/init.el:
(with-eval-after-load "tex"
  ;; enable synctex support for latex-mode
  (add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
  ;; add a new view program
  (add-to-list 'TeX-view-program-list
        '("Zathura"
          ("zathura" " %o"
           (mode-io-correlate " --synctex-forward %n:0:%b"))))
  (setcdr (assq 'output-pdf TeX-view-program-selection) '("Zathura")))



(setq xenops-reveal-on-entry t
      xenops-image-directory (expand-file-name "xenops/image" user-emacs-directory)
      xenops-math-latex-process 'dvisvgm
      xenops-math-image-scale-factor 0.7
      )

(defun xenops-math-reveal (element)
  "Remove image overlay for ELEMENT.
If a prefix argument is in effect, also delete its cache file."
  (xenops-element-overlays-delete element)
  (if current-prefix-arg
      (delete-file (xenops-math-get-cache-file element)))
  ;; TODO: is :begin-content for block math off by one?
  (let ((element-type (plist-get element :type))
        (begin-content (plist-get element :begin-content)))
    )
  (xenops-math-render-below-maybe element))

(use-package cdlatex
:straight t
)
(defun my/latex-hooks ()
 (turn-on-cdlatex)
 (visual-line-mode t)
 (visual-fill-column-mode t)
)

(add-hook 'LaTeX-mode-hook 'my/latex-hooks)
(add-hook 'latex-mode-hook 'my/latex-hooks)

(add-hook 'pdf-view-mode 'pdf-view-themed-minor-mode)   ; normal emacs latex mode
(set-default 'preview-scale-function 1.1)

(defvar pdf-minimal-width 72
  "Minimal width of a window displaying a pdf.
If an integer, number of columns.  If a float, fraction of the
original window.")

(defvar pdf-split-width-threshold 120
  "Minimum width a window should have to split it horizontally
for displaying a pdf in the right.")

#+end_src

** Biblatex and cite configuration

#+begin_src emacs-lisp

(use-package citar
  :straight t
  :hook
  (LaTeX-mode . citar-capf-setup)
  (org-mode . citar-capf-setup)
  :custom
  (citar-bibliography '("/home/vikash/Documents/my_notes/bib/references.bib")))

(add-to-list 'completion-at-point-functions #'citar-capf)
(setq citar-search-function #'citar-ivy-filter)

(use-package bibtex
  :straight t
  :custom
  (bibtex-dialect 'BibTeX)
  (bibtex-user-optional-fields
   '(("keywords" "Keywords to describe the entry" "")
     ("file" "Link to a document file." "" )))
  (bibtex-align-at-equal-sign t))

(use-package citar-embark
  :straight t
  :after citar embark
  :no-require
  :config (citar-embark-mode))

(use-package biblio
  :straight t)

#+end_src

#+RESULTS:


* Spell and Grammar Check

