.emacs.d/init.org
** Flyspell
For spell checking the go-to tool in emacs is flycheck. The configuration given in the emacs wiki seems sound. I will just copy paste them here.

#+begin_src emacs-lisp

; Seems like flyspell is already installed in emacs; just set it up
  (dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
(dolist (hook '(change-log-mode-hook log-edit-mode-hook))
  (add-hook hook (lambda () (flyspell-mode -1))))

;; (global-set-key (kbd "<f8>") 'ispell-word)
;; to note vim key-binding z= also works for ispell=word checking
(global-set-key (kbd "C-S-<f8>") 'flyspell-mode)
(global-set-key (kbd "C-M-<f8>") 'flyspell-buffer)
(global-set-key (kbd "C-<f8>") 'flyspell-check-previous-highlighted-word)
(defun flyspell-check-next-highlighted-word ()
  "Custom function to spell check next highlighted word"
  (interactive)
  (flyspell-goto-next-error)
  (ispell-word)
  )
(global-set-key (kbd "M-<f8>") 'flyspell-check-next-highlighted-word) 

#+end_src

#+RESULTS:

** Language server
An alternative tool to keep track of is flycheck-languagetool. This setup will have the options 'M-x langtoo-? to pass the entire text.
#+begin_src emacs-lisp

(use-package langtool
  :straight t)
(setq langtool-java-classpath
      "/usr/share/languagetool:/usr/share/java/languagetool/*")

#+end_src


* Magit
Magit is a emacs package to use git in the buffer. 

#+begin_src emacs-lisp
 (use-package magit
  :straight t
  :commands magit-status
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; NOTE: Make sure to configure a GitHub token before using this package!
;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(use-package forge
  :straight t
  :after magit) 


#+end_src

#+RESULTS:


* Ellama 
This is for interacting with the local AI from emacs.

#+begin_src emacs-lisp
(use-package ellama
  :straight t
  :ensure t
  :bind ("C-c e" . ellama-transient-main-menu)
  ;; send last message in chat buffer with C-c C-c
  :hook (org-ctrl-c-ctrl-c-final . ellama-chat-send-last-message)
  :init (setopt ellama-auto-scroll t)
  :config
  ;; show ellama context in header line in all buffers
  (ellama-context-header-line-global-mode +1))

#+end_src

* Other subsidiaries 
** Markdown-modes
#+begin_src emacs-lisp
  (use-package markdown-mode
  :ensure t
  :straight t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
         ("C-c C-e" . markdown-do)))
(use-package yaml-mode
:ensure t
:straight t)
#+end_src

#+RESULTS:

** Emms- emacs native music player
#+begin_src emacs-lisp

  (use-package emms
    :straight t
    :init
    (require 'emms-setup)
    (require 'emms-mpris)
    (emms-all)
    (emms-default-players)
    (emms-mpris-enable)
    :hook
    (emms-browser-mode . visual-fill-column-mode)
    :custom
    (emms-source-file-default-directory "~/Music")
    (emms-browser-covers #'emms-browser-cache-thumbnail-async)
    :bind
    (("<f5>"   . emms-browser)
     ("M-<f5>" . emms)
     ("M-p" . emms-previous)
     ("M-n" . emms-next)
     ("M-s" . emms-pause)))

(emms-all)
(setq emms-player-list '(emms-player-mpv)
      emms-info-functions '(emms-info-native))

#+end_src

#+RESULTS:
| emms-info-native |

** EAF for quick browsing 
This seems to have too much of dependencies. If one breaks everything comes crashing down like cards. Although it is wishful thinking. 
#+begin_src emacs-lisp

(add-to-list 'load-path "~/.emacs.d/site-lisp/emacs-application-framework/")
;; (require 'eaf)
;; (require 'eaf-browser)
;; (require 'eaf-pdf-viewer)

#+end_src

#+RESULTS:
: eaf-browser

** Resizing the buffer
#+begin_src emacs-lisp
  
(use-package windresize
  :straight t)

(global-set-key (kbd "<f2>") 'windresize)

#+end_src

#+RESULTS:
: windresize


* Custom 

#+begin_src emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(TeX-view-program-selection
   '(((output-dvi has-no-display-manager)
      "dvi2tty")
     ((output-dvi style-pstricks)
      "Zathura")
     (output-dvi "Zathura")
     (output-pdf "Zathura")
     (output-html "xdg-open")))
 '(display-time-24hr-format t)
 '(f90-comment-region "!!")
 '(org-agenda-window-setup 'only-window)
 '(org-highlight-latex-and-related '(native))
 '(tex-fontify-script nil)
'(org-startup-folded t))


#+end_src

#+RESULTS:
            



* Might be relevant some-day
These functions will build html from buffer and render.

#+begin_src example
(defun org-babel-render-html ()
  (interactive)
  (let* ((element (org-element-at-point))
         (start (org-element-property :begin element))
         (end (org-element-property :end element))
         (value (org-element-property :value element)))
    (goto-char start)
    (forward-line)
    (delete-region (point) end)
    (insert value)
    (shr-render-region start (point))
    (goto-char start)
    (forward-line)
    (delete-char -1)))

(defun org-babel-process-export-html-block ()
  (interactive)
  (let* ((element (org-element-context))
         (beg (org-element-property :begin element))
         (end (org-element-property :end element))
         (value (org-element-property :value element)))
    (with-temp-buffer
      (insert value)
      (shr-render-buffer (current-buffer)))
    (let ((html-contents (with-current-buffer "*html*"
                           (unless (text-properties-at (point))
                             (let ((contents (buffer-string)))
                               (kill-buffer)
                               contents)))))
      (when (print html-contents)
        (kill-region beg end)
        (goto-char beg)
        (insert "#+RESULTS\n: " html-contents "\n")))))

config for the unicode fonts

(use-package unicode-fonts
  :straight t
  :config
  ;; Common math symbols
  (dolist (unicode-block '("Mathematical Alphanumeric Symbols"))
    (push "JuliaMono" (cadr (assoc unicode-block unicode-fonts-block-font-mapping))))
  (dolist (unicode-block '("Greek and Coptic"))
    (push "Iosevka Custom" (cadr (assoc unicode-block unicode-fonts-block-font-mapping))))
  ;; CJK characters
  (dolist (unicode-block '("CJK Unified Ideographs" "CJK Symbols and Punctuation" "CJK Radicals Supplement" "CJK Compatibility Ideographs"))
    (push "Sarasa Mono SC" (cadr (assoc unicode-block unicode-fonts-block-font-mapping))))
  (dolist (unicode-block '("Hangul Syllables" "Hangul Jamo Extended-A" "Hangul Jamo Extended-B"))
    (push "Sarasa Mono K" (cadr (assoc unicode-block unicode-fonts-block-font-mapping))))
  ;; Other unicode block
  (dolist (unicode-block '("Braille Patterns"))
    (push "Iosevka Custom" (cadr (assoc unicode-block unicode-fonts-block-font-mapping))))
  )

#+end_src example




Initialize thermodynamic rel  








